# Pandas Missing Values, Datetime, Aggregation, and Merging

## Lecture Notes and in-class exercises

‚ñ∂Ô∏è First, run the code cell below to import `unittest`, a module used for **üß≠ Check Your Work** sections and the autograder.

In [1]:
import unittest
tc = unittest.TestCase()

#### üëá Tasks

- ‚úîÔ∏è Import the following Python packages.
    1. `pandas`: Use alias `pd`.
    2. `numpy`: Use alias `np`.

In [2]:
### BEGIN SOLUTION
import pandas as pd
import numpy as np
### END SOLUTION

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [3]:
import sys
tc.assertTrue('pd' in globals(), 'Check whether you have correctly import Pandas with an alias.')
tc.assertTrue('np' in globals(), 'Check whether you have correctly import NumPy with an alias.')

---

## üëâ Working with Missing Values

A dataset commonly can contain one or more missing values. Pandas provides a flexible set of methods for you to work with missing values. Missing values can be represented in multiple ways. Here are few common notations that denote a missing value.

- `NaN`: NaN stands for "not a number".
- `None`: python's built-in type (equivalent to `null` in other programming languages)
- `NA`: A native scalar to denote a missing value in `pandas`
- `NaT`: NaT stands for "not a time".

In [4]:
# NaN
nan_example = np.nan
print(nan_example)

nan

In [5]:
# None
none_example = None
print(none_example)

None

In [6]:
# NA
na_example = pd.NA
print(na_example)

<NA>

In [7]:
# NaT
nat_example = pd.NaT
print(nat_example)

NaT

---

### üìå Load data

‚ñ∂Ô∏è Run the code cell below to create a new `DataFrame` named `df_people`.

In [8]:
# DO NOT CHANGE THE CODE IN THIS CELL
df_people = pd.read_csv("https://raw.githubusercontent.com/UI-Deloitte-business-analytics-center/datasets/main/people-sample.csv")

# Used to keep a clean copy
df_people_backup = df_people.copy()

# head() displays the first 5 rows of a DataFrame
df_people.head()

,name,major1,major2,city,fav_restaurant,fav_movie,has_iphone
0,Dwight Boon,Accountancy,Marketing,Fairfax,Chick-fil-a,Ford vs Ferrari,False
1,Jaclyn Kay,Marketing,NaN,Ploiesti,NaN,NaN,False
2,Wade Kitchens,Supply Chain Management,Marketing,Naperville,Noodles and Company,The Mummy,True
3,Rajeev Frye,Statistics,NaN,Chicago,Soho House,The Shawshank Redemption,False
4,Rowland Waldo,Nondegree,NaN,Grayslake,Chipotle,Inception,True

The table below describes each column in `df_people`.

| Column Name             | Description                                               |
|-------------------------|-----------------------------------------------------------|
| name                    | Full name                                                |
| major1                  | Major                                                     |
| major2                  | Second major OR minor (blank if no second major or no minor) |
| city                    | City the person is from                                   |
| fav_restaurant          | Favorite restaurant (blank if no restaurant was given)    |
| has_iphone              | Whether the person use an iPhone                          |

---

### üéØ Challenge 1: People from Grayslake

#### üëá Tasks

- ‚úîÔ∏è Using `df_people`, filter rows where the person is from `"Grayslake"`.
    - Check whether the `city` column is equal to `"Grayslake"`.
    - Store the result to a new variable named `df_grayslake`.
- ‚úîÔ∏è `df_people` should remain unaltered after your code.

In [9]:
### BEGIN SOLUTION
df_grayslake = df_people[df_people["city"] == "Grayslake"]
### END SOLUTION

df_grayslake

,name,major1,major2,city,fav_restaurant,fav_movie,has_iphone
4,Rowland Waldo,Nondegree,NaN,Grayslake,Chipotle,Inception,True
19,Maud Dickenson,Accountancy,NaN,Grayslake,Big Bowl,The Trial of Chicago 7,True

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [10]:
# df_people should remain unaltered
pd.testing.assert_frame_equal(df_people, df_people_backup)

pd.testing.assert_frame_equal(df_grayslake.sort_values(df_grayslake.columns.tolist()).reset_index(drop=True),
                              df_people_backup.query(f'{"cItY".lower()} == "{"GraYsLakE".capitalize()}"')
                                 .sort_values(df_people_backup.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 2: Anyone with a non-missing `major2`

#### üëá Tasks

- ‚úîÔ∏è Using `df_people`, filter rows where the person has a second major or a minor.
    - You're looking for rows where `major2` is not `NaN`.
- ‚úîÔ∏è `NaN` is a special value to denote missing value. You must use `my_series.isna()` or `my_series.notna()` to check whether a row contains a missing value or not.
- ‚úîÔ∏è Store the result to a new variable named `df_major2`.
- ‚úîÔ∏è `df_people` should remain unaltered after your code.

#### üöÄ Hints

- `my_series.notna()` can be used to check whether a row contains a missing value or not.

![notna](https://github.com/bdi475/images/blob/main/pandas/notna-series.png?raw=true)

In [11]:
### BEGIN SOLUTION
df_major2 = df_people[df_people["major2"].notna()]
### END SOLUTION

df_major2

,name,major1,major2,city,fav_restaurant,fav_movie,has_iphone
0,Dwight Boon,Accountancy,Marketing,Fairfax,Chick-fil-a,Ford vs Ferrari,False
2,Wade Kitchens,Supply Chain Management,Marketing,Naperville,Noodles and Company,The Mummy,True
9,Eldred Bullard,Econometrics & Quant Econ,Computer Science,Evanston,Cravings,TRON: Legacy,False
10,Conrad Sargent,Advertising,Marketing,Evanston,Dominos,NaN,True
11,Berenice Lewis,Computer Science & Econom,Business,Urbana,Olive Garden,NaN,True
12,Monica Morris,Statistics & Computer Sci,Business,Oak Park,Chipotle,Rounders,True
14,Sara Janson,Computer Science & Econom,Statistics,Chicago,Texas Roadhouse,Stepbrothers,True
15,Inderjeet Joyner,Accountancy,Finance,Highland Park,Sushi King,Wolf of Wall Street,True
17,Tate Parent,Accountancy,Finance,Urbana,Pizzaria Antica,NaN,True
20,Flynn Woodrow,Accountancy,Supply Chain Management,Wuxi,Haidilao,Interstellar,True
29,Bailey Farnham,Computer Science,Business,Rockford,Chipotle,NaN,True

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [12]:
# df_people should remain unaltered
pd.testing.assert_frame_equal(df_people, df_people_backup)

pd.testing.assert_frame_equal(df_major2.sort_values(df_major2.columns.tolist()).reset_index(drop=True),
                              df_people_backup.query(f"major2 == major2")
                                 .sort_values(df_people_backup.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 3: Anyone without a favorite movie

#### üëá Tasks

- ‚úîÔ∏è Using `df_people`, filter rows where the person's `fav_movie` is `NaN`.
- ‚úîÔ∏è `NaN` is a special value to denote missing value. You must use `my_series.isna()` or `my_series.notna()` to compare a `Series` with `NaN`.
- ‚úîÔ∏è Store the result to a new variable named `df_no_fav_movie`.
- ‚úîÔ∏è `df_people` should remain unaltered after your code.

#### üöÄ Hints

- `my_series.isna()` can be used to check whether a row contains a missing value.

In [13]:
### BEGIN SOLUTION
df_no_fav_movie = df_people[df_people["fav_movie"].isna()]
### END SOLUTION

df_no_fav_movie

,name,major1,major2,city,fav_restaurant,fav_movie,has_iphone
1,Jaclyn Kay,Marketing,NaN,Ploiesti,NaN,NaN,False
10,Conrad Sargent,Advertising,Marketing,Evanston,Dominos,NaN,True
11,Berenice Lewis,Computer Science & Econom,Business,Urbana,Olive Garden,NaN,True
16,Kimberlee Gupta,Computer Science,NaN,Naperville,NaN,NaN,True
17,Tate Parent,Accountancy,Finance,Urbana,Pizzaria Antica,NaN,True
21,Erick Hollins,Psychology,NaN,Orland Park,NaN,NaN,True
22,Marsha Brett,Accountancy,NaN,Lake Forest,NaN,NaN,True
23,Chanda Neal,Nondegree,NaN,Buffalo Grove,McDonalds,NaN,True
24,Lei Tyler,Mathematics,NaN,Vernon Hills,NaN,NaN,True
26,Xinyi Cookson,Chemical Engineering,NaN,Northbrook,Burger King,NaN,False
27,Layton Overton,Information Sciences,NaN,Champaign,Noodles and Company,NaN,True
28,Reshmi Backus,Nondegree,NaN,Urbana,Haidilao,NaN,True
29,Bailey Farnham,Computer Science,Business,Rockford,Chipotle,NaN,True
30,Prabhakar Ryley,Econometrics & Quant Econ,NaN,Dubai,California Pizza Kitchen,NaN,True
31,Monday Clifford,Economics,NaN,Fremont,Olive Garden,NaN,True
33,Miranda Steele,Statistics,NaN,Champaign,NaN,NaN,True
34,Viraj Tatham,Information Sciences,NaN,Champaign,NaN,NaN,True
36,Yuwen Xiang,Statistics,NaN,Northbrook,NaN,NaN,True
37,Eleanore Powers,Accountancy,NaN,Vernon Hills,Chick-fil-a,NaN,False
38,Sachin Weston,Computer Science & Econom,NaN,Naperville,McDonalds,NaN,False

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [14]:
# df_people should remain unaltered
pd.testing.assert_frame_equal(df_people, df_people_backup)

pd.testing.assert_frame_equal(df_no_fav_movie.sort_values(df_no_fav_movie.columns.tolist()).reset_index(drop=True),
                              df_people_backup.query(f"fav_movie != fav_movie")
                                 .sort_values(df_people_backup.columns.tolist()).reset_index(drop=True))

---

## üóìÔ∏è Working with Datetime Values

You will often see date-looking strings in your data. A few examples are:

- `20210315`
- `Mar 15, 2021`
- `2020-03-15`
- `2020/3/15`

In this part, we'll discuss how we can *parse* and utilize datetime values.

---

### üìå Load employees data

‚ñ∂Ô∏è Run the code cell below to create a new `DataFrame` named `df_emp`.

In [15]:
# DO NOT CHANGE THE CODE IN THIS CELL
df_emp = pd.DataFrame({
    'emp_id': [30, 40, 10, 20],
    'name': ['Talal', 'Josh', 'Anika', 'Aishani'],
    'dept': ['Finance', 'Purchase', 'Finance', 'Purchase'],
    'office_phone': ['(217)123-4500', np.nan, np.nan, '(217)987-6600'],
    'start_date': ['2017-05-01', '2018-02-01', '2020-08-01', '2019-12-01'],
    'salary': [202000, 185000, 240000, 160500]
})

# Used for intermediate checks
df_emp_backup = df_emp.copy()

df_emp

   emp_id     name      dept   office_phone  start_date  salary
0      30    Talal   Finance  (217)123-4500  2017-05-01  202000
1      40     Josh  Purchase            NaN  2018-02-01  185000
2      10    Anika   Finance            NaN  2020-08-01  240000
3      20  Aishani  Purchase  (217)987-6600  2019-12-01  160500

**Question**: What is the data type of the `start_date` column?

‚ñ∂Ô∏è Run `str(df_emp['start_date'].dtype)` below to see the data type of the `start_date` column.

In [16]:
### BEGIN SOLUTION
str(df_emp['start_date'].dtype)
### END SOLUTION

'object'

While `object` can refer to many different types, you can safely assume that all `object` data types you see in this course refer to strings.

---

### üéØ Challenge 4: Parse a string column as datetime

#### üëá Tasks

- ‚úîÔ∏è Parse `start_date` to a `datetime` data type.
- ‚úîÔ∏è Store the result to a new column named `start_date_parsed`.

#### üöÄ Hints

The code below converts `date_str` column to a `datetime`-typed column and stores the converted result to a new column named `date_parsed`.

```python
my_dataframe['date_parsed'] = pd.to_datetime(my_dataframe['date_str'])
```

In [17]:
### BEGIN SOLUTION
df_emp['start_date_parsed'] = pd.to_datetime(df_emp['start_date'])
### END SOLUTION

df_emp

,emp_id,name,dept,office_phone,start_date,salary,start_date_parsed
0,30,Talal,Finance,(217)123-4500,2017-05-01,202000,2017-05-01
1,40,Josh,Purchase,NaN,2018-02-01,185000,2018-02-01
2,10,Anika,Finance,NaN,2020-08-01,240000,2020-08-01
3,20,Aishani,Purchase,(217)987-6600,2019-12-01,160500,2019-12-01

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [18]:
tc.assertEqual(set(df_emp.columns), set(df_emp_backup.columns.tolist() + ['start_date_parsed']))
pd.testing.assert_series_equal(df_emp['start_date_parsed'].reset_index(drop=True),
                               pd.to_datetime(df_emp_backup['_'.join(['sTarT', 'DaTe']).lower()])
                                  .reset_index(drop=True),
                               check_names=False)

---

‚ñ∂Ô∏è Run `str(df_emp['start_date_parsed'].dtype)` below to see the data type of the `start_date` column.

In [19]:
# BEGIN SOLUTION
str(df_emp['start_date_parsed'].dtype)
### END SOLUTION

'datetime64[ns]'

---

### üéØ Challenge 5: Drop `start_date` column *in-place*

We no longer need the `start_date` column. We'll work with the new `start_date_parsed` column from this point on.

#### üëá Tasks

- ‚úîÔ∏è Drop `start_date` column from `df_emp` *in-place*.

#### üöÄ Hints

The code below drops `col1` from `my_dataframe` *in-place* without creating a new variable.

```python
my_dataframe.drop(columns=['col1'], inplace=True)
```

In [20]:
### BEGIN SOLUTION
df_emp.drop(columns=['start_date'], inplace=True)
### END SOLUTION

df_emp

   emp_id     name      dept   office_phone  salary start_date_parsed
0      30    Talal   Finance  (217)123-4500  202000        2017-05-01
1      40     Josh  Purchase            NaN  185000        2018-02-01
2      10    Anika   Finance            NaN  240000        2020-08-01
3      20  Aishani  Purchase  (217)987-6600  160500        2019-12-01

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [21]:
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date'])

# Check result
tc.assertEqual(set(df_emp.columns), set(['start_date_parsed', 'salary', 'office_phone', 'dept', 'name', 'emp_id']))
pd.testing.assert_frame_equal(df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 6: Rename `start_date_parsed` to `start_date`

#### üëá Tasks

- ‚úîÔ∏è Rename `start_date_parsed` to `start_date` in `df_emp` *in-place*.

#### üöÄ Hints

The code below renames the `name_before` column to `name_after` in `my_dataframe` *in-place* without creating a new variable.

```python
my_dataframe.rename(columns={'name_before': 'name_after'}, inplace=True)
```

In [22]:
### BEGIN SOLUTION
df_emp.rename(columns={'start_date_parsed': 'start_date'}, inplace=True)
### END SOLUTION

df_emp

   emp_id     name      dept   office_phone  salary start_date
0      30    Talal   Finance  (217)123-4500  202000 2017-05-01
1      40     Josh  Purchase            NaN  185000 2018-02-01
2      10    Anika   Finance            NaN  240000 2020-08-01
3      20  Aishani  Purchase  (217)987-6600  160500 2019-12-01

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [23]:
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})

# Check result
pd.testing.assert_frame_equal(df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 7: Extract year from a datetime column

#### üëá Tasks

- ‚úîÔ∏è Create a new column named `start_year` in `df_emp` that contains the starting years in integers (e.g., `2017`, `2018`).
- ‚úîÔ∏è Extract values from `df_emp['start_date']`.

#### üöÄ Hints

The code extracts the year of a datetime column `my_date` and stores it to a new column named `my_year`.

```python
my_dataframe['my_year'] = my_dataframe['my_date'].dt.year
```

In [24]:
### BEGIN SOLUTION
df_emp['start_year'] = df_emp['start_date'].dt.year
### END SOLUTION

df_emp

   emp_id     name      dept   office_phone  salary start_date  start_year
0      30    Talal   Finance  (217)123-4500  202000 2017-05-01        2017
1      40     Josh  Purchase            NaN  185000 2018-02-01        2018
2      10    Anika   Finance            NaN  240000 2020-08-01        2020
3      20  Aishani  Purchase  (217)987-6600  160500 2019-12-01        2019

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [25]:
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})
df_check['_'.join(['sTarT', 'yEaR']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.year

df_emp_check = df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True)
df_check = df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True)
cols_to_check = ['emp_id', 'start_year']

# Check result
pd.testing.assert_frame_equal(df_emp_check[cols_to_check],
                              df_check[cols_to_check])

---

### üéØ Challenge 8: Extract month, day of month from a datetime column

#### üëá Tasks

- ‚úîÔ∏è Create new columns named `start_month` and `start_day` in `df_emp` that contain the starting months and days of month in integers.
- ‚úîÔ∏è Extract values from `df_emp['start_date']`.

#### üöÄ Hints

The code extracts the months and days of a datetime column `my_date` and stores it to two new columns.

```python
my_dataframe['my_month'] = my_dataframe['my_date'].dt.month
my_dataframe['my_day'] = my_dataframe['my_date'].dt.day
```

In [26]:
### BEGIN SOLUTION
df_emp['start_month'] = df_emp['start_date'].dt.month
df_emp['start_day'] = df_emp['start_date'].dt.day
### END SOLUTION

df_emp

,emp_id,name,dept,office_phone,salary,start_date,start_year,start_month,start_day
0,30,Talal,Finance,(217)123-4500,202000,2017-05-01,2017,5,1
1,40,Josh,Purchase,NaN,185000,2018-02-01,2018,2,1
2,10,Anika,Finance,NaN,240000,2020-08-01,2020,8,1
3,20,Aishani,Purchase,(217)987-6600,160500,2019-12-01,2019,12,1

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [27]:
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})
df_check['_'.join(['sTarT', 'mOnTh']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.month
df_check['_'.join(['sTarT', 'dAy']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.day

df_emp_check = df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True)
df_check = df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True)
cols_to_check = ['emp_id', 'start_month', 'start_day']

# Check result
pd.testing.assert_frame_equal(df_emp_check[cols_to_check],
                              df_check[cols_to_check])

---

### üéØ Challenge 9: Extract quarter, weekday of month from a datetime column

#### üëá Tasks

- ‚úîÔ∏è Create new columns named `start_quarter` and `start_weekday` in `df_emp` that contain the starting quarters and weekdays of month in integers.
- ‚úîÔ∏è Extract values from `df_emp['start_date']`.

#### üöÄ Hints

The code extracts the quarters and weekdays of a datetime column `my_date` and stores it to two new columns.

```python
my_dataframe['my_quarter'] = my_dataframe['my_date'].dt.quarter
my_dataframe['my_weekday'] = my_dataframe['my_date'].dt.weekday
```

In [28]:
### BEGIN SOLUTION
df_emp['start_quarter'] = df_emp['start_date'].dt.quarter
df_emp['start_weekday'] = df_emp['start_date'].dt.weekday
### END SOLUTION

df_emp

,emp_id,name,dept,office_phone,salary,start_date,start_year,start_month,start_day,start_quarter,start_weekday
0,30,Talal,Finance,(217)123-4500,202000,2017-05-01,2017,5,1,2,0
1,40,Josh,Purchase,NaN,185000,2018-02-01,2018,2,1,1,3
2,10,Anika,Finance,NaN,240000,2020-08-01,2020,8,1,3,5
3,20,Aishani,Purchase,(217)987-6600,160500,2019-12-01,2019,12,1,4,6

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [29]:
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})
df_check['_'.join(['sTarT', 'qUarTer']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.quarter
df_check['_'.join(['sTarT', 'wEeKDaY']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.weekday

df_emp_check = df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True)
df_check = df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True)
cols_to_check = ['emp_id', 'start_quarter', 'start_weekday']

# Check result
pd.testing.assert_frame_equal(df_emp_check[cols_to_check],
                              df_check[cols_to_check])